/**************************************************************************************
*		              静态数码管显示实验												  *
实现现象：下载程序后数码管静态显示0。
注意事项：如果不想让点阵模块显示，可以将74HC595模块上的JP595短接片拔掉。																				  
***************************************************************************************/

#include "reg52.h"			 //此文件中定义了单片机的一些特殊功能寄存器

typedef unsigned int u16;	  //对数据类型进行声明定义
typedef unsigned char u8;

sbit LSA=P2^0;
sbit LSB=P2^1;
sbit LSC=P2^2;
sbit LSD=P2^3;
sbit LSE=P2^4;
sbit LSF=P2^5;
sbit LSG=P2^6;
sbit LSH=P2^7;
sbit  A=P3^0;
sbit  BIY=P3^1;
sbit  CIY=P3^2;
sbit  DIY=P3^3;
u8 code smgduan[17]={0xc0,0xf9,0xa4,0xb0,0x99,0x92,0x82,0xf8,
					0x80,0x90,0x88,0x83,0xc6,0xa1,0x86,0x8e};//显示0~F的值


/*******************************************************************************
* 函 数 名       : main
* 函数功能		 : 主函数
* 输    入       : 无
* 输    出    	 : 无
*******************************************************************************/
void main()
{	


	A=0;
	BIY=0;
	CIY=0;
	DIY=0;
	P0=smgduan[16];
	while(1);
}
